# vsoWidgetSetText

## Description
```pascal
PROCEDURE vsoWidgetSetText(
				widgetID : LONGINT;
				text     : STRING);
```

```python

def vs.vsoWidgetSetText(widgetID, text):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|widgetID|LONGINT||
|text|STRING||

## Version
Availability: from Vectorworks 2011
## Category
* Object Events